read_verilog rtl/base/*.v
read_verilog rtl/pipeline/*.v
read_verilog rtl/memory/*.v

hierarchy -top core
hierarchy -check

synth_ice40 -json mips-x.json
stat